Revit 2026 API

# AssetPropertiesFindByName Method

---

Gets the property with the given name.

**Namespace:** Autodesk.Revit.DB.Visual**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public AssetProperty FindByName(
	string name
)
```
```vb
Public Function FindByName (
	name As String
) As AssetProperty
```
```cpp
public:
AssetProperty^ FindByName(
	String^ name
)
```
```fsharp
member FindByName :
        name : string -> AssetProperty
```

#### Parameters

name String
     Name of the property.

#### Return Value

AssetProperty The property with the specified name.

| Exception | Condition |
| --- | --- |
| ArgumentNullException | A non-optional argument was null |

FindByName will not visit the properties of any connected asset on any of the properties.

#### Reference

AssetProperties Class

Autodesk.Revit.DB.Visual Namespace